[M_Aster_PlotMission02 MissionDefinition]
TurnInDescription="Enlisting the help of fallen warriors, the Archhunter explores the Holy Witch's machinations and learns about the Queen's House. Luckily, a group of new friends was waiting for them at a small mine...."

[M_Aster_PlotMission02:BlowupTHEOCEAN MissionObjectiveDefinition]
ProgressMessage="explosion in the ocean"

[M_Aster_PlotMission02:CollectBloodfruitwithoutkillingtreeant MissionObjectiveDefinition]
ProgressMessage="Get adventurous without killing."

[M_Aster_PlotMission02:CollectFirstBloodFruitSet MissionObjectiveSetDefinition]
MissionSummaryOverride="Before collecting blood."
MissionDescriptionOverride="the Queen [place]Pamrock Shelter[-place] A lost place [place]They eat trees that live in the forest[-place]. Eleanor asks the witch to go into the forest to find the princess..<br><br>Forest Chief Devlin arrives. To get there, you need to collect blood cells in the forest."

[M_Aster_PlotMission02:CollectTwoBloodFruits MissionObjectiveDefinition]
ProgressMessage="You will take a blood sample"

[M_Aster_PlotMission02:DefeatDragonsSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="Queen [place]a flint hut[-place] disappeared somewhere [place]A forest that eats trees alive[-place]. Eleanor's sword tells her to follow the princess into the forest.<br><br>Devlin finds another door on the ship that only a man named the White Knight can enter. You must find this knight to reach the queen.<br>The knight looks like Roland, or at least a fictionalized version of Thylas Roland. If you can help him kill a nearby dragon, Roland will help you find the princess.."

[M_Aster_PlotMission02:DefeatGhostKingSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="the queen [place]Flamerock soul[-place] He fell into place [place]The forest eats the living tree[-place]. Eleanor asked you to go to the forest to find the queen.<br><br>While searching for the king, they found a living tree. Devlin turns into a love witch with a mysterious plan, summons the demon king, and uses a curse to kill the Tree of Life before he and Roland can defeat it. Of course, you must destroy the king's soul and continue searching for the princess.."

[M_Aster_PlotMission02:FindQueensTrail MissionObjectiveDefinition]
ProgressMessage="Walk the path of a princess."

[M_Aster_PlotMission02:FindWhiteKnight MissionObjectiveDefinition]
ProgressMessage="In search of the white secret"

[M_Aster_PlotMission02:FindWhiteKnightSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="the Queen [place]he rejected the stone[-place] Stay inside. [place]Forests and trees[-place]. The swordsman says to go to the forest and follow the princess..<br><br>Devlin revealed another threat involving a man known as "The White Knight." You need to find this hero to get to the princess.."

[M_Aster_PlotMission02:GiveBloodFruits MissionObjectiveDefinition]
ProgressMessage="Give Devlin a Blood Fruit"

[M_Aster_PlotMission02:GiveBloodFruitsSet MissionObjectiveSetDefinition]
MissionSummaryOverride="Davelyn got blood."
MissionDescriptionOverride="Princess [place]Flamerock Temple[-place] The place is lost [place]A forest where plants enjoy life[-place]. Eleanor's Sword tells you to go into the forest to find the princess.<br><br>If you find a princess, you get the tree of life. Devlin believes that if you give him blood, he can remove the magical curse and bring light to the world even without the queen's help. He asks you to donate blood."

[M_Aster_PlotMission02:MeetGuardNPCSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="the queen [place]Two apartments[-place] Hide somewhere [place]The tree is alive[-place]. Lady Eleanor tells him to go into the forest and follow the queen.<br><br>You need Devlin (before the village guard turned into Thurg) to lead you to the queen - you need to talk to him.."

[M_Aster_PlotMission02:PaintSymbolsWithBloodFruitSet MissionObjectiveSetDefinition]
MissionSummaryOverride="A good representation of an orchid using fruit juice.."

[M_Aster_PlotMission02:QueenBreadCrumb1 MissionObjectiveSetDefinition]
MissionDescriptionOverride="The queen [place]Shelter on fire[-place] Lost somewhere [place]The forest feeds the trees[-place]. You are asked to go to the forest to look for Queen Eleanor, the swordswoman..<br><br>Tina finds a collection of jewelry on the floor and confirms that it belongs to the Queen. This queen is so rich she can throw jewels into the forest instead of pieces, but she wants to take you. You have to follow."

[M_Aster_PlotMission02:QueenBreadCrumb21 MissionObjectiveSetDefinition]
MissionSummaryOverride="follow the queen."
MissionDescriptionOverride="the princess [place]Garden of Memories[-place] Lost somewhere inside [place]I gave life to wild trees[-place]. Swordsman Eleanor invites you to enter the forest to find the princess.<br><br>Tina finds a bunch of gems on the ground and looks like a princess. This princess - a rich lady who throws jewels into the forest instead of trinkets - looks like she's trying to eat you. Credit is good.."

[M_Aster_PlotMission02:ReturnWithRolandSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="the queen [place]Huoshi Temple[-place] It just disappears. [place]The tree eats the forest[-place]. The swordsman tells Eleanor to follow the princess into the forest..<br><br>Davlin found the Orc Gate and crossed it with the help of a man named the White Knight.."

[M_Aster_PlotMission02:TalkToRoland MissionObjectiveDefinition]
ProgressMessage="Talk to white people."

[M_Aster_PlotMission02:TalkToRolandAfterBeatingDragonSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="queen [place]Flamerock Chapel[-place] And he entered another [place]in the trees of the forest when I lived[-place]. Eleanor's sword prompts you into the forest and follow the queen.<br><br>Davlin found another door for the "White Knight" to pass through. You saw a soldier, talk to him and he will help you.."
